import Wrapper from "@/components/wrapper/wrapper";
import styles from "./page.module.scss";

export default function History() {
    return (
        <div>
            <Wrapper>
                <h1>Історія Музею</h1>
                <p className={styles.text}>
                    У 1630 р. на цьому місці був деревʼяний монастир й
                    рівночасно деревʼяний костел під назвою св. мчч. Роха і
                    Себастьяна. Деревʼяні костел і монастир простояли до війни
                    1648 р. У цьому році, під час облоги Львова військами
                    Богдана Хмельницького, вони згоріли. Новий мурований
                    монастир почали будувати у 1656 р.
                    <br />
                    У 1783 р. австрійська влада провела касацію монастиря
                    Реформатів, а келії передали Сестрам Милосердя для утримання
                    дитячого притулку, монастиря та шпиталю, розташованих у
                    східній частині території комплексу. Сиротинець, котрий
                    провадили сестри Милосердя, функціонував до 1939 р. У
                    1950-1970-х рр. приміщення сиротинця слугувало трудовою
                    колонією для неповнолітніх дівчат. Від 1968 р. усі корпуси
                    та територія комплексу колишнього монастиря сестер Милосердя
                    використовувались школою міліції, а нині – Львівським
                    державним університетом внутрішніх справ.
                    <br />У 2020 р. приміщення першого поверху келій були
                    відреставровані та адаптовані під музей Митрополита Андрея
                    Шептицького. Засновником та директором музею, який
                    знаходиться у приватній власності Львівської митрополії
                    УГКЦ, є д-р о. Севастьян (Степан Дмитрух). О. Севастьян є
                    знаним колекціонером та опікуном предметів сакрального
                    мистецтва, а також частини речей митрополита Андрея
                    Шептицького. Саме його колекція експонатів, яку він збирає
                    десятиліттями, стала основою для музею. Зараз відбувається
                    активне відновлення інших частин монастирського комплексу,
                    опис архівних одиниць, робота реставраційних майстерень та
                    проведення тимчасових виставок.
                    <br />
                    Історія колекції музею тісно пов’язана з особистою
                    ініціативою та тривалою працею о. Севастіяна Дмитруха, який
                    власноруч збирав усі експонати, що нині складають основу
                    музейного фонду. Колекція поєднує в собі предмети сакральної
                    спадщини, а також речі, які пов’язують із постаттю
                    митрополита Андрея. Частина з них — це об’єкти, які люди
                    зберігали, щиро вірячи в їхню автентичність і належність
                    самому Шептицькому.
                    <br />
                    Незалежно від ступеня історичної достовірності, ці речі
                    мають високу символічну цінність і свідчать про народну
                    пам’ять, пошану й тривале зацікавлення його постаттю.
                    Завдяки цій унікальній колекції та особистим історіям людей,
                    які зберігали й передавали ці речі, музей отримав можливість
                    запропонувати нову інтерпретацію спадщини Митрополита
                    Андрея. Ці предмети не лише формують матеріальну основу
                    експозиції, а й відкривають простір для осмислення народної
                    пам’яті, віри й поваги до його постаті. Відтак музей
                    перебуває в процесі оновлення та трансформації — він
                    реформується у Музей Пам’яті Митрополита Андрея, щоб глибше,
                    сучасніше й більш осмислено говорити про його роль у
                    духовному, культурному й національному житті України.
                </p>
            </Wrapper>
        </div>
    );
}
